import Box from '@mui/material/Box';
import '../../styles/SituationPractice/ScrollBar.css'

function Script(){
    return (
    <Box className='text-[#EFCC87] w-3/5' style={{marginLeft: '3%'}}>
      <div
        className='sm:text-lg md:text-lg lg:text-xl xl:text-xl max-h-[70vh] pr-4 overflow-y-auto custom-scrollbar'
        >
        안녕하세요, 오늘은 우리가 잘 알고 있는 동물, 고양이에 대해 이야기해보겠습니다.
        고양이는 전 세계에서 사랑받는 반려동물 중 하나입니다. 우아한 몸놀림과 독립적인 성격, 그리고 특유의 귀여움으로 많은 사람들에게 큰 행복을 줍니다.
        고양이의 가장 큰 특징 중 하나는 유연한 몸입니다. 이 유연성 덕분에 높은 곳을 쉽게 오르거나 좁은 틈새를 통과할 수 있죠. 또한, 뛰어난 균형 감각으로 가는 발걸음 하나도 신중하게 내딛습니다.
        고양이는 독립적인 성향이 강하지만, 주인과 깊은 유대감을 형성하기도 합니다. 특히 고양이는 주인에게 관심을 표현할 때, 몸을 비비거나 가르랑거리는 소리를 내며 애정을 표현하죠.
        또한 고양이는 사냥 본능이 뛰어나 작은 움직임에도 즉각 반응합니다. 장난감 하나만 있어도 하루 종일 사냥놀이를 즐길 수 있습니다.
        안녕하세요, 오늘은 우리가 잘 알고 있는 동물, 고양이에 대해 이야기해보겠습니다.
        고양이는 전 세계에서 사랑받는 반려동물 중 하나입니다. 우아한 몸놀림과 독립적인 성격, 그리고 특유의 귀여움으로 많은 사람들에게 큰 행복을 줍니다.
        고양이의 가장 큰 특징 중 하나는 유연한 몸입니다. 이 유연성 덕분에 높은 곳을 쉽게 오르거나 좁은 틈새를 통과할 수 있죠. 또한, 뛰어난 균형 감각으로 가는 발걸음 하나도 신중하게 내딛습니다.
        고양이는 독립적인 성향이 강하지만, 주인과 깊은 유대감을 형성하기도 합니다. 특히 고양이는 주인에게 관심을 표현할 때, 몸을 비비거나 가르랑거리는 소리를 내며 애정을 표현하죠.
        또한 고양이는 사냥 본능이 뛰어나 작은 움직임에도 즉각 반응합니다. 장난감 하나만 있어도 하루 종일 사냥놀이를 즐길 수 있습니다.
      </div>
    </Box>
    )
}

export default Script;